IdeaRS.OpenModel.Message.NonConformitySeverity
Nonconformity severities

IdeaRS.OpenModel.Message.NonConformitySeverity.Info
Information

IdeaRS.OpenModel.Message.NonConformitySeverity.Warning
Deal as warning

IdeaRS.OpenModel.Message.NonConformitySeverity.Error
Error

IdeaRS.OpenModel.Message.NonConformitySeverity.TerminatedError
Error, coancel of the calculation required